UGP - 0007 : Improving section modules and implementating progressive reading percentage
